{"columns":["agent_address","agent_logo","agent_name","agent_phone","category","country","country_code","county","description","details_url","displayable_address","first_published_date","floor_plan","furnished_state","image_150_113_url","image_354_255_url","image_50_38_url","image_645_430_url","image_80_60_url","image_caption","image_url","last_published_date","latitude","listing_id","listing_status","location_is_approximate","longitude","num_bathrooms","num_bedrooms","num_floors","num_recepts","outcode","post_town","price","price_change","price_modifier","property_type","short_description","status","street_name","thumbnail_url"],"index":[0],"data":[["35 Cadogan Street, London","https:\/\/st.zoocdn.com\/zoopla_static_agent_logo_(589430).png","Strutt & Parker - National Country House Department","020 8115 0265","Residential","England","gb","Bristol","Weston Lodge is a most appealing Grade II listed house dating from the mid 18th century and believed to have originated as a hunting lodge forming part of the local Miles estate. The handsome stucco elevations have large regularly spaced windows and a central porch on thefaçade making a welcoming entrance point. The present owners have done much to restore and improve the house since acquiring the property in 2007. There are many fine original architectural features such as stone and wooden floors, ornate ceiling mouldings, working shutters and fireplaces. Of particular note is the delightful central staircase with mahogany banister. The comprehensive improvements include replacements of the wiring, joinery (as required) plumbing and heating system. The benefits are ca T 5 cabling, air source underfloor heating to the house (ground source to the cottage), sound system, cctv and alarm system. On entering the large central hall there is a feeling of space and light typical of Georgian houses. The elegant rooms flow around the hall and all enjoy views of th e gardens and woodland which form part of the property. A reception hall has been fitted with a bar to enhance the entertaining space. The kitchen\/breakfast room is a large room, ideally placed neighbouring the hall and the drawing room, with extensive cabinets and cupboards including an island unit and breakfast bar topped with granite and hard wood work surfaces and fitted with good quality white goods. The first floor provides bedrooms and bathrooms with the luxury main suite comprising bedroom, dressing room and bathroom. There are 4 further bedrooms and a further bathroom and shower room being accessible by the secondary stairs.Weston Lodge is well situated in the North Somerset countryside. Communications are excellent with a railway station at Nailsea & Backwell (7 miles) linking to Bristol Parkway (14 miles), Bristol Temple Meads (11.5 miles) and Bristol Airport (12 miles).There are some excellent schools in the area including Clifton College, Clifton High School, Bristol Grammar School, Badminton, Queen Elizabeth Hospital School and The Downs School, Wraxall.A number of highly regarded golf courses can be found nearby, these include Bristol and Clevedon Golf Club, Ashton Court Mansion Golf Club and Long Ashton Golf Club. Bristol has a number of sporting clubs including first class rugby, county cricket and championship football. Fishing is available on rivers Frome, Wye and Avon as well as Barrow Reservoir, Chew Valley and Blagdon Lakes.Local Shopping can be found in Portishead, and Clevedon with more extensive shopping available at Cribbs Causeway andCabot Circus.The CottageA detached single storey cottage. The property underwent a comprehensive renovation and provides excellent secondary accommodation which is independent of the main house. There are 2 bedrooms and a private garden.Gardens And GroundsThe property is approached over a long private drive from the centre of the village. Passing through woodland belonging to the property before opening up to sweeping lawns which border both the house and the walled garden. The drive leads to the rear of the house and alarge enclosed gravel forecourt. A second drive (drive 2, coloured light pink on the plan) provides access to Valley Road to the east of the property. A wide stone path lined with clipped box leads to the walled garden. Restored and landscaped to provide wide flagstone paths and open lawns. There is an established shrub and flower bed along the northern wall enjoying the southerly aspect and the former potting shed have been restored. To the west of the house is the tennis court. The open pasture land extends to 10 acres and is to the east of the house. The woodland extends to 15 acres and is to the south and west of the house.Lot 2 - The BarnsA range of former outbuildings have consent for conversion into three dwellings. The buildings require development. Separated from the property by a high stone wall. In the event Lot 2 is not purchased with Lot 1 the owners will retain the drive (drive 2 coloured light punk on the plan) to the east to serve as access to this site and any future dwellings.","https:\/\/www.zoopla.co.uk\/for-sale\/details\/48797779?utm_source=v1:r7CKHGKYCkrM70e6aL59ojjuO0Es2r7Z&utm_medium=api","Hill Lane, Weston-In-Gordano, Bristol BS20","2019-04-18 00:25:51",["https:\/\/lc.zoocdn.com\/d0acf0e9dd979bd89e3ef4401a899c60db27e50b.jpg"],null,"https:\/\/lid.zoocdn.com\/150\/113\/da080371d16157eb83885d7010d8491dfbda42e7.jpg","https:\/\/lid.zoocdn.com\/354\/255\/da080371d16157eb83885d7010d8491dfbda42e7.jpg","https:\/\/lid.zoocdn.com\/50\/38\/da080371d16157eb83885d7010d8491dfbda42e7.jpg","https:\/\/lid.zoocdn.com\/645\/430\/da080371d16157eb83885d7010d8491dfbda42e7.jpg","https:\/\/lid.zoocdn.com\/80\/60\/da080371d16157eb83885d7010d8491dfbda42e7.jpg","Picture No. 01","https:\/\/lid.zoocdn.com\/354\/255\/da080371d16157eb83885d7010d8491dfbda42e7.jpg","2019-04-18 00:25:51",51.465576,"48797779","sale",0,-2.799919,"0","5","0","5","BS20","Bristol","3000000",[{"direction":"","date":"2019-04-18 00:21:40","percent":"0%","price":"3000000"}],"guide_price","Detached house","An appealing Grade II listed house set amid 27 acres and offering development potential. Available as a whole or in two lots","for_sale","Hill Lane","https:\/\/lid.zoocdn.com\/80\/60\/da080371d16157eb83885d7010d8491dfbda42e7.jpg"]]}